# Copyright (c) 2020, NVIDIA CORPORATION. All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions
# are met:
#  * Redistributions of source code must retain the above copyright
#    notice, this list of conditions and the following disclaimer.
#  * Redistributions in binary form must reproduce the above copyright
#    notice, this list of conditions and the following disclaimer in the
#    documentation and/or other materials provided with the distribution.
#  * Neither the name of NVIDIA CORPORATION nor the names of its
#    contributors may be used to endorse or promote products derived
#    from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY
# EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
# IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR
# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
# OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
# OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

name: "bert_ensemble"
platform: "ensemble"

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1, 384 ]
  },
  {
    name: "token_type_ids"
    data_type: TYPE_INT64
    dims: [ -1, 384 ]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1, 384 ]
  },
  {
    name: "batch_mask"
    data_type: TYPE_BOOL
    dims: [ 3, -1 ]
  },
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ -1, 384, 2 ]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ -1, 384, 2 ]
  },
  {
    name: "batch_mask"
    data_type: TYPE_BOOL
    dims: [ 3, -1 ]
  }
]

ensemble_scheduling {
  step [ 
    {
      model_name: "bert_e0p0"
      model_version: -1
      input_map {
        key: "input_ids"
        value: "input_ids"
      }
      input_map {
        key: "token_type_ids"
        value: "token_type_ids"
      }
      input_map {
        key: "attention_mask"
        value: "attention_mask"
      }
      input_map {
        key: "batch_mask"
        value: "batch_mask"
      }
      input_map {
        key: "logits"
        value: "logits"
      }
      output_map {
        key: "logits"
        value: "logits_0"
      }
      output_map {
        key: "batch_mask"
        value: "batch_mask_0"
      }
    },
    {
      model_name: "bert_e1p0"
      model_version: -1
      input_map {
        key: "logits"
        value: "logits_0"
      }
      input_map {
        key: "input_ids"
        value: "input_ids"
      }
      input_map {
        key: "token_type_ids"
        value: "token_type_ids"
      }
      input_map {
        key: "attention_mask"
        value: "attention_mask"
      }
      input_map {
        key: "batch_mask"
        value: "batch_mask_0"
      }
      output_map {
        key: "logits"
        value: "logits"
      }
      output_map {
        key: "batch_mask"
        value: "batch_mask"
      }
    }
  ]
}